In [1]:
import pandas as pd
import MySQLdb

ModuleNotFoundError: No module named 'pandas'

In [7]:
import warnings
warnings.filterwarnings(action='ignore')

In [3]:
df = pd.read_csv('budongsan.csv')
df.head()

,Unnamed: 0,매물번호,연락처,주소,부동산,보증금,월세
0,0,3467204.0,010-123-4567,서울시 강남구 역삼동 0,TODAY공인중개사(이인규),1000.0,100.0
1,1,3150497.0,010-123-4567,서울시 강남구 역삼동 1,TODAY공인중개사(이인규),11000.0,60.0
2,2,3440906.0,010-123-4567,서울시 강남구 역삼동 2,열린공인중개사(강광수),5000.0,65.0
3,3,3376834.0,010-123-4567,서울시 강남구 역삼동 3,미래공인중개사(김유철),3000.0,95.0
4,4,3331511.0,010-123-4567,서울시 강남구 역삼동 4,한백부동산공인중개사(김남조),110.0,110.0

In [4]:
db = MySQLdb.connect('localhost', 'root', '1234', charset='utf8')

In [5]:
cursor = db.cursor()

In [10]:
sql = '''
show databases;
'''

pd.read_sql(sql, db)

              Database
0   information_schema
1            budongsan
2            employees
3                mysql
4   performance_schema
5               sakila
6               shopdb
7                sqldb
8                  sys
9               testdb
10               world

In [9]:
sql = """
create database if not exists budongsan;
"""

cursor.execute(sql)

1

In [11]:
sql = '''
use budongsan;
'''
cursor.execute(sql)

0

In [12]:
sql = '''
show tables;
'''

pd.read_sql(sql, db)

Empty DataFrame
Columns: [Tables_in_budongsan]
Index: []

In [14]:
sql = '''
create table if not exists provider (
provider_id int primary key,
name varchar(255)
);
'''

cursor.execute(sql)

0

In [20]:
sql = '''
insert into provider values (2, '우리부동산');
insert into provider values (3, '현대부동산');

insert into provider values (4, '휴먼부동산');
insert into provider values (5, '미래부동산');
'''

cursor.execute(sql)

1

In [21]:
sql = 'select * from provider;'

pd.read_sql(sql, db)

   provider_id   name
0            2  우리부동산
1            3  현대부동산
2            4  휴먼부동산
3            5  미래부동산

In [25]:
df_db = pd.read_csv('budongsan.csv', index_col=0)
df_db.head()

        매물번호           연락처             주소              부동산      보증금     월세
0  3467204.0  010-123-4567  서울시 강남구 역삼동 0  TODAY공인중개사(이인규)   1000.0  100.0
1  3150497.0  010-123-4567  서울시 강남구 역삼동 1  TODAY공인중개사(이인규)  11000.0   60.0
2  3440906.0  010-123-4567  서울시 강남구 역삼동 2     열린공인중개사(강광수)   5000.0   65.0
3  3376834.0  010-123-4567  서울시 강남구 역삼동 3     미래공인중개사(김유철)   3000.0   95.0
4  3331511.0  010-123-4567  서울시 강남구 역삼동 4  한백부동산공인중개사(김남조)    110.0  110.0

In [29]:
sql = """
create table if not exists agency (
prd_no int primary key,
phone char(12) not null,
addr varchar(20),
b_agency varchar(30),
deposit int,
rent int);
"""

cursor.execute(sql)

0

In [30]:
sql = 'show tables;'
pd.read_sql(sql, db)

  Tables_in_budongsan
0              agency
1            provider

In [32]:
for i in range(len(df_db)):
    print(df_db.iloc[i])

매물번호          3467204.0
연락처        010-123-4567
주소        서울시 강남구 역삼동 0
부동산     TODAY공인중개사(이인규)
보증금              1000.0
월세                100.0
Name: 0, dtype: object
매물번호          3150497.0
연락처        010-123-4567
주소        서울시 강남구 역삼동 1
부동산     TODAY공인중개사(이인규)
보증금             11000.0
월세                 60.0
Name: 1, dtype: object
매물번호        3440906.0
연락처      010-123-4567
주소      서울시 강남구 역삼동 2
부동산      열린공인중개사(강광수)
보증금            5000.0
월세               65.0
Name: 2, dtype: object
매물번호        3376834.0
연락처      010-123-4567
주소      서울시 강남구 역삼동 3
부동산      미래공인중개사(김유철)
보증금            3000.0
월세               95.0
Name: 3, dtype: object
매물번호          3331511.0
연락처        010-123-4567
주소        서울시 강남구 역삼동 4
부동산     한백부동산공인중개사(김남조)
보증금               110.0
월세                110.0
Name: 4, dtype: object
매물번호          3373198.0
연락처        010-123-4567
주소        서울시 강남구 역삼동 5
부동산     강남코리아공인중개사(기숙영)
보증금             15000.0
월세                 70.0
Name: 5, dtype: object
매물번호        3376434.0
연락처      010-123-4567
주소      서울시 강남구 역삼동 6
부동산      열린공인중개사(강광수)
보증금            1000.0
월세               85.0
Name: 6, dtype: object
매물번호        3322860.0
연락처      010-123-4567
주소      서울시 강남구 역삼동 7
부동산      한강공인중개사(김상헌)
보증금            1000.0
월세               80.0
Name: 7, dtype: object
매물번호        3303061.0
연락처      010-123-4567
주소      서울시 강남구 역삼동 8
부동산      동하공인중개사(임성우)
보증금            1000.0
월세               60.0
Name: 8, dtype: object
매물번호        3262172.0
연락처      010-123-4567
주소      서울시 강남구 역삼동 9
부동산      스타공인중개사(박정직)
보증금            2000.0
월세               50.0
Name: 9, dtype: object
매물번호         3228631.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 10
부동산     HS강남공인중개사(김현수)
보증금             1000.0
월세                96.0
Name: 10, dtype: object
매물번호         3505011.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 11
부동산        H공인중개사(김용만)
보증금            15000.0
월세                70.0
Name: 11, dtype: object
매물번호         3249401.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 12
부동산       도원공인중개사(손석진)
보증금               65.0
월세                65.0
Name: 12, dtype: object
매물번호         3330951.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 13
부동산     강남우리공인중개사(어정화)
보증금             2000.0
월세               150.0
Name: 13, dtype: object
매물번호         3494055.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 14
부동산       청록공인중개사(하순자)
보증금             3000.0
월세                60.0
Name: 14, dtype: object
매물번호         3317227.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 15
부동산      커피한잔공인중개사(손별)
보증금              500.0
월세                67.0
Name: 15, dtype: object
매물번호          3405679.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 16
부동산     강남코리아공인중개사(기숙영)
보증금             15000.0
월세                 60.0
Name: 16, dtype: object
매물번호          3103384.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 17
부동산     TODAY공인중개사(이인규)
보증금              5000.0
월세                 50.0
Name: 17, dtype: object
매물번호         3418616.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 18
부동산       나무공인중개사(조민영)
보증금               90.0
월세                90.0
Name: 18, dtype: object
매물번호         3456814.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 19
부동산       한강공인중개사(김상헌)
보증금              300.0
월세                80.0
Name: 19, dtype: object
매물번호          3181675.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 20
부동산     TODAY공인중개사(이인규)
보증금              5000.0
월세                 60.0
Name: 20, dtype: object
매물번호          3309372.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 21
부동산     한백부동산공인중개사(김남조)
보증금                75.0
월세                 75.0
Name: 21, dtype: object
매물번호          3501566.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 22
부동산     강남코리아공인중개사(기숙영)
보증금              1000.0
월세                 65.0
Name: 22, dtype: object
매물번호         3346510.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 23
부동산       도원공인중개사(손석진)
보증금               65.0
월세                65.0
Name: 23, dtype: object
매물번호          3406670.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 24
부동산     TODAY공인중개사(이인규)
보증금              1000.0
월세                 60.0
Name: 24, dtype: object
매물번호         3493254.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 25
부동산     아셈타운공인중개사(임현옥)
보증금             7000.0
월세               100.0
Name: 25, dtype: object
매물번호          3501607.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 26
부동산     강남코리아공인중개사(기숙영)
보증금              2000.0
월세                 63.0
Name: 26, dtype: object
매물번호         3484623.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 27
부동산       웰컴공인중개사(이영진)
보증금             1000.0
월세               120.0
Name: 27, dtype: object
매물번호         3190410.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 28
부동산       건우공인중개사(김상모)
보증금               70.0
월세                70.0
Name: 28, dtype: object
매물번호         3350050.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 29
부동산       NB공인중개사(길주현)
보증금             1000.0
월세                70.0
Name: 29, dtype: object
매물번호            3495453.0
연락처          010-123-4567
주소         서울시 강남구 역삼동 30
부동산     부동산네트워크공인중개사(황창문)
보증금                8000.0
월세                   55.0
Name: 30, dtype: object
매물번호         3446619.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 31
부동산       도원공인중개사(손석진)
보증금               68.0
월세                68.0
Name: 31, dtype: object
매물번호         3451078.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 32
부동산       스타공인중개사(박정직)
보증금             4000.0
월세                40.0
Name: 32, dtype: object
매물번호         3345445.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 33
부동산       대청공인중개사(이선영)
보증금            14000.0
월세                70.0
Name: 33, dtype: object
매물번호          3332380.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 34
부동산     한백부동산공인중개사(김남조)
보증금             10000.0
월세                100.0
Name: 34, dtype: object
매물번호         3450803.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 35
부동산       스타공인중개사(박정직)
보증금             6000.0
월세                50.0
Name: 35, dtype: object
매물번호         3471049.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 36
부동산       정성공인중개사(정문식)
보증금              100.0
월세               100.0
Name: 36, dtype: object
매물번호          3438747.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 37
부동산     TODAY공인중개사(이인규)
보증금              3000.0
월세                100.0
Name: 37, dtype: object
매물번호         3330749.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 38
부동산       미래공인중개사(김유철)
보증금             1000.0
월세                85.0
Name: 38, dtype: object
매물번호          3446920.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 39
부동산     한백부동산공인중개사(김남조)
보증금                75.0
월세                 75.0
Name: 39, dtype: object
매물번호          3501554.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 40
부동산     강남코리아공인중개사(기숙영)
보증금              1000.0
월세                 63.0
Name: 40, dtype: object
매물번호         3435418.0
연락처       010-123-4567
주소      서울시 강남구 역삼동 41
부동산      친절한공인중개사(김천호)
보증금              500.0
월세                65.0
Name: 41, dtype: object
매물번호          3501551.0
연락처        010-123-4567
주소       서울시 강남구 역삼동 42
부동산     강남코리아공인중개사(기숙영)
보증금              3000.0
월세                 75.0
Name: 42, dtype: object

In [40]:
s = df_db.iloc[0]
s

매물번호          3467204.0
연락처        010-123-4567
주소        서울시 강남구 역삼동 0
부동산     TODAY공인중개사(이인규)
보증금              1000.0
월세                100.0
Name: 0, dtype: object

In [42]:
s.iloc[0]

3467204.0

In [44]:
sql = "insert into agency values({}, '{}', '{}', '{}', {}, {});"\
.format(s.iloc[0], s.iloc[1], s.iloc[2], s.iloc[3], s.iloc[4], s.iloc[5])

cursor.execute(sql)

1

In [45]:
sql = 'select * from agency;'
pd.read_sql(sql, db)

    prd_no         phone           addr         b_agency  deposit  rent
0  3467204  010-123-4567  서울시 강남구 역삼동 0  TODAY공인중개사(이인규)     1000   100

In [46]:
sql = 'delete from agency'
cursor.execute(sql)

1

In [47]:
for i in range(len(df_db)):
    
    s = df_db.iloc[i]
    
    sql = "insert into agency values({}, '{}', '{}', '{}', {}, {});"\
    .format(s.iloc[0], s.iloc[1], s.iloc[2], s.iloc[3], s.iloc[4], s.iloc[5])
    
    cursor.execute(sql)

In [49]:
sql = "select * from agency;"
df = pd.read_sql(sql, db)

In [51]:
df.to_csv('agency.csv')

In [52]:
df.head()

    prd_no         phone            addr         b_agency  deposit  rent
0  3103384  010-123-4567  서울시 강남구 역삼동 17  TODAY공인중개사(이인규)     5000    50
1  3150497  010-123-4567   서울시 강남구 역삼동 1  TODAY공인중개사(이인규)    11000    60
2  3181675  010-123-4567  서울시 강남구 역삼동 20  TODAY공인중개사(이인규)     5000    60
3  3190410  010-123-4567  서울시 강남구 역삼동 28     건우공인중개사(김상모)       70    70
4  3228631  010-123-4567  서울시 강남구 역삼동 10   HS강남공인중개사(김현수)     1000    96

In [53]:
df.deposit.mean()

3512.046511627907

In [57]:
df.sort_values('rent').head(1)

     prd_no         phone            addr      b_agency  deposit  rent
30  3451078  010-123-4567  서울시 강남구 역삼동 32  스타공인중개사(박정직)     4000    40